TestingTool_3-0/src/InformationRegisters/СинонимыТестов/СинонимыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинонимыТестов</name>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/CommonModules/СценарноеТестированиеВызовСервера/Module.bsl
Функция ПолучитьСоответствиеНастроекПользователя(Знач Пользователь, Знач ТекущееРабочееМесто) Экспорт
	
	Возврат СценарноеТестированиеСервер.ПолучитьСоответствиеНастроекПользователя(Пользователь, ТекущееРабочееМесто);
	
КонецФункции

Функция ПолучитьПутьКФайлуСценария(Знач Тест, Знач ПутьКВременномуКаталогуФайлов="", Знач ПутьКаталогGIT="") Экспорт
	
	Возврат СценарноеТестированиеСервер.ПолучитьПутьКФайлуСценария(Тест,ПутьКВременномуКаталогуФайлов,ПутьКаталогGIT);
	
КонецФункции 

Функция ОбработатьСтрокуПоПараметрам(Знач ИсходнаяСтрока, Знач СтруктураПараметров)   Экспорт
	
	Возврат СценарноеТестированиеСервер.ОбработатьСтрокуПоПараметрам(ИсходнаяСтрока, СтруктураПараметров);
	
КонецФункции


Процедура УстановитьСинонимТеста(Знач Тест, Знач Синоним) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СинонимыТестов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Тест = Тест;
	МенеджерЗаписи.Синоним = Синоним;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры


Функция ПолучитьСинонимТеста(Знач Тест) Экспорт
	
	Синоним = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СинонимыТестов.Тест КАК Тест,
	|	СинонимыТестов.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.СинонимыТестов КАК СинонимыТестов
	|ГДЕ
	|	СинонимыТестов.Тест = &Тест";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Синоним;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Синоним;
	
КонецФункции
